*** git_perf/src/audit.rs:150:41: replace / with * in audit

*** mutation diff:
--- git_perf/src/audit.rs
+++ replace / with * in audit
@@ -142,17 +142,17 @@
     let relative_max = all_measurements
         .iter()
         .max_by(|a, b| a.partial_cmp(b).unwrap())
         .unwrap()
         / tail_median
         - 1.0;
 
     // Calculate relative deviation of HEAD measurement using tail median
-    let head_relative_deviation = (head / tail_median - 1.0).abs() * 100.0;
+    let head_relative_deviation = (head * /* ~ changed by cargo-mutants ~ */ tail_median - 1.0).abs() * 100.0;
 
     // Check if we have a minimum relative deviation threshold configured
     let min_relative_deviation = config::audit_min_relative_deviation(measurement);
     let threshold_applied = min_relative_deviation.is_some();
     let passed_due_to_threshold = min_relative_deviation
         .map(|threshold| head_relative_deviation < threshold)
         .unwrap_or(false);

*** result: Success
