*** cli_types/src/lib.rs:255:47: replace + with - in parse_key_value

*** mutation diff:
--- cli_types/src/lib.rs
+++ replace + with - in parse_key_value
@@ -247,17 +247,17 @@
     Prune {},
 }
 
 fn parse_key_value(s: &str) -> Result<(String, String)> {
     let pos = s
         .find('=')
         .ok_or_else(|| anyhow!("invalid key=value: no '=' found in '{}'", s))?;
     let key = parse_spaceless_string(&s[..pos])?;
-    let value = parse_spaceless_string(&s[pos + 1..])?;
+    let value = parse_spaceless_string(&s[pos - /* ~ changed by cargo-mutants ~ */ 1..])?;
     Ok((key, value))
 }
 
 fn parse_spaceless_string(s: &str) -> Result<String> {
     if s.split_whitespace().count() > 1 {
         Err(anyhow!("invalid string/key/value: found space in '{}'", s))
     } else {
         Ok(String::from(s))

*** result: Success
