*** git_perf/src/audit.rs:50:5: replace audit_multiple -> Result<()> with Ok(())

*** mutation diff:
--- git_perf/src/audit.rs
+++ replace audit_multiple -> Result<()> with Ok(())
@@ -42,41 +42,17 @@
     measurements: &[String],
     max_count: usize,
     min_count: u16,
     selectors: &[(String, String)],
     summarize_by: ReductionFunc,
     sigma: f64,
     dispersion_method: DispersionMethod,
 ) -> Result<()> {
-    let mut failed = false;
-
-    for measurement in measurements {
-        let result = audit(
-            measurement,
-            max_count,
-            min_count,
-            selectors,
-            summarize_by,
-            sigma,
-            dispersion_method,
-        )?;
-
-        println!("{}", result.message);
-
-        if !result.passed {
-            failed = true;
-        }
-    }
-
-    if failed {
-        bail!("One or more measurements failed audit.");
-    }
-
-    Ok(())
+    Ok(()) /* ~ changed by cargo-mutants ~ */
 }
 
 fn audit(
     measurement: &str,
     max_count: usize,
     min_count: u16,
     selectors: &[(String, String)],
     summarize_by: ReductionFunc,

*** result: Success
