*** cli_types/src/lib.rs:284:13: replace - with + in parse_datetime_value

*** mutation diff:
--- cli_types/src/lib.rs
+++ replace - with + in parse_datetime_value
@@ -276,17 +276,17 @@
     let (num, unit) = input.split_at(input.len() - 1);
     let num: i64 = num.parse()?;
     let subtractor = match unit {
         "w" => Duration::weeks(num),
         "d" => Duration::days(num),
         "h" => Duration::hours(num),
         _ => bail!("Unsupported datetime format"),
     };
-    Ok(*now - subtractor)
+    Ok(*now + /* ~ changed by cargo-mutants ~ */ subtractor)
 }
 
 #[cfg(test)]
 mod test {
     use clap::CommandFactory;
 
     use super::*;

*** result: Success
