*** cli_types/src/lib.rs:30:13: delete match arm "stddev" in <impl FromStr for DispersionMethod>::from_str

*** mutation diff:
--- cli_types/src/lib.rs
+++ delete match arm "stddev" in <impl FromStr for DispersionMethod>::from_str
@@ -22,17 +22,17 @@
     MedianAbsoluteDeviation,
 }
 
 impl FromStr for DispersionMethod {
     type Err = anyhow::Error;
 
     fn from_str(s: &str) -> Result<Self, Self::Err> {
         match s {
-            "stddev" => Ok(DispersionMethod::StandardDeviation),
+             /* ~ changed by cargo-mutants ~ */
             "mad" => Ok(DispersionMethod::MedianAbsoluteDeviation),
             _ => Err(anyhow!(
                 "Invalid dispersion method: {}. Valid values are 'stddev' or 'mad'",
                 s
             )),
         }
     }
 }

*** result: Success
