*** git_perf/src/config.rs:126:5: replace determine_epoch_from_config -> Option<u32> with None

*** mutation diff:
--- git_perf/src/config.rs
+++ replace determine_epoch_from_config -> Option<u32> with None
@@ -118,27 +118,17 @@
 
 fn read_config_from_file<P: AsRef<Path>>(file: P) -> Result<String> {
     let mut conf_str = String::new();
     StdFile::open(file)?.read_to_string(&mut conf_str)?;
     Ok(conf_str)
 }
 
 pub fn determine_epoch_from_config(measurement: &str) -> Option<u32> {
-    let config = read_hierarchical_config()
-        .map_err(|e| {
-            // Log the error but don't fail - this is expected when no config exists
-            log::debug!("Could not read hierarchical config: {}", e);
-        })
-        .ok()?;
-
-    // Use parent fallback for measurement epoch
-    config
-        .get_with_parent_fallback("measurement", measurement, "epoch")
-        .and_then(|s| u32::from_str_radix(&s, 16).ok())
+    None /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn bump_epoch_in_conf(measurement: &str, conf_str: &mut String) -> Result<()> {
     let mut conf = conf_str
         .parse::<Document>()
         .map_err(|e| anyhow::anyhow!("Failed to parse config: {}", e))?;
 
     let head_revision = get_head_revision()?;

*** result: Success
