*** git_perf/src/git/git_lowlevel.rs:103:55: replace match guard output.stderr.contains("but expected") with false in map_git_error

*** mutation diff:
--- git_perf/src/git/git_lowlevel.rs
+++ replace match guard output.stderr.contains("but expected") with false in map_git_error
@@ -95,17 +95,17 @@
 
 pub(super) fn map_git_error(err: GitError) -> GitError {
     // Parsing error messasges is not a very good idea, but(!) there are no consistent + documented error code for these cases.
     // This is tested by the git compatibility check and we add an explicit LANG to the git invocation.
     match err {
         GitError::ExecError { command: _, output } if output.stderr.contains("cannot lock ref") => {
             GitError::RefFailedToLock { output }
         }
-        GitError::ExecError { command: _, output } if output.stderr.contains("but expected") => {
+        GitError::ExecError { command: _, output } if false /* ~ changed by cargo-mutants ~ */ => {
             GitError::RefConcurrentModification { output }
         }
         GitError::ExecError { command: _, output } if output.stderr.contains("find remote ref") => {
             GitError::NoRemoteMeasurements { output }
         }
         GitError::ExecError { command: _, output } if output.stderr.contains("bad object") => {
             GitError::BadObject { output }
         }

*** result: Success
