*** git_perf/src/git/git_lowlevel.rs:142:5: replace get_head_revision -> Result<String> with Ok(String::new())

*** mutation diff:
--- git_perf/src/git/git_lowlevel.rs
+++ replace get_head_revision -> Result<String> with Ok(String::new())
@@ -134,17 +134,17 @@
         &None,
         Some(commands.as_ref()),
     )
     .map_err(map_git_error)
     .map(|_| ())
 }
 
 pub fn get_head_revision() -> Result<String> {
-    Ok(internal_get_head_revision()?)
+    Ok(String::new()) /* ~ changed by cargo-mutants ~ */
 }
 
 pub(super) fn internal_get_head_revision() -> Result<String, GitError> {
     git_rev_parse("HEAD")
 }
 
 pub(super) fn git_rev_parse(reference: &str) -> Result<String, GitError> {
     capture_git_output(&["rev-parse", "--verify", "-q", reference], &None)

*** result: Success
