*** git_perf/src/reporting.rs:143:9: replace <impl Reporter<'a> for PlotlyReporter>::as_bytes -> Vec<u8> with vec![0]

*** mutation diff:
--- git_perf/src/reporting.rs
+++ replace <impl Reporter<'a> for PlotlyReporter>::as_bytes -> Vec<u8> with vec![0]
@@ -135,17 +135,17 @@
         } else {
             trace.name(measurement_name)
         };
 
         self.plot.add_trace(trace);
     }
 
     fn as_bytes(&self) -> Vec<u8> {
-        self.plot.to_html().as_bytes().to_vec()
+        vec![0] /* ~ changed by cargo-mutants ~ */
     }
 }
 
 struct CsvReporter<'a> {
     hashes: Vec<String>,
     indexed_measurements: Vec<(usize, &'a MeasurementData)>,
     summarized_measurements: Vec<(usize, String, Option<String>, MeasurementSummary)>,
 }

*** result: Success
