*** git_perf/src/reporting.rs:269:42: replace && with || in report

*** mutation diff:
--- git_perf/src/reporting.rs
+++ replace && with || in report
@@ -261,17 +261,17 @@
     let commits: Vec<Commit> = measurement_retrieval::walk_commits(num_commits)?.try_collect()?;
 
     let mut plot =
         ReporterFactory::from_file_name(&output).ok_or(anyhow!("Could not infer output format"))?;
 
     plot.add_commits(&commits);
 
     let relevant = |m: &MeasurementData| {
-        if !measurement_names.is_empty() && !measurement_names.contains(&m.name) {
+        if !measurement_names.is_empty() || /* ~ changed by cargo-mutants ~ */ !measurement_names.contains(&m.name) {
             return false;
         }
         // TODO(kaihowl) express this and the audit-fn equivalent as subset relations
         key_values
             .iter()
             .all(|(k, v)| m.key_values.get(k).map(|mv| v == mv).unwrap_or(false))
     };

*** result: Success
