*** git_perf/src/reporting.rs:275:58: replace == with != in report

*** mutation diff:
--- git_perf/src/reporting.rs
+++ replace == with != in report
@@ -267,17 +267,17 @@
 
     let relevant = |m: &MeasurementData| {
         if !measurement_names.is_empty() && !measurement_names.contains(&m.name) {
             return false;
         }
         // TODO(kaihowl) express this and the audit-fn equivalent as subset relations
         key_values
             .iter()
-            .all(|(k, v)| m.key_values.get(k).map(|mv| v == mv).unwrap_or(false))
+            .all(|(k, v)| m.key_values.get(k).map(|mv| v != /* ~ changed by cargo-mutants ~ */ mv).unwrap_or(false))
     };
 
     let relevant_measurements = commits
         .iter()
         .map(|commit| commit.measurements.iter().filter(|m| relevant(m)));
 
     let unique_measurement_names: Vec<_> = relevant_measurements
         .clone()

*** result: Success
