*** git_perf/src/reporting.rs:58:38: replace - with / in PlotlyReporter::convert_to_x_y

*** mutation diff:
--- git_perf/src/reporting.rs
+++ replace - with / in PlotlyReporter::convert_to_x_y
@@ -50,17 +50,17 @@
         let mut plot = Plot::new();
         plot.set_configuration(config);
         PlotlyReporter { plot, size: 0 }
     }
 
     fn convert_to_x_y(&self, indexed_measurements: Vec<(usize, f64)>) -> (Vec<usize>, Vec<f64>) {
         indexed_measurements
             .iter()
-            .map(|(i, m)| (self.size - i - 1, m))
+            .map(|(i, m)| (self.size / /* ~ changed by cargo-mutants ~ */ i - 1, m))
             .unzip()
     }
 }
 
 impl<'a> Reporter<'a> for PlotlyReporter {
     fn add_commits(&mut self, commits: &'a [Commit]) {
         let enumerated_commits = commits.iter().rev().enumerate();
         self.size = commits.len();

*** result: Success
