*** git_perf/src/serialization.rs:20:5: replace serialize_single -> String with String::new()

*** mutation diff:
--- git_perf/src/serialization.rs
+++ replace serialize_single -> String with String::new()
@@ -12,28 +12,17 @@
 use crate::data::MeasurementData;
 
 pub const DELIMITER: &str = "";
 
 pub fn serialize_single<M>(measurement_data: &M, custom_delimiter: &str) -> String
 where
     M: Borrow<MeasurementData>,
 {
-    let md: &MeasurementData = measurement_data.borrow();
-
-    let mut m = vec![
-        format!("{:?}", md.epoch),
-        md.name.clone(),
-        format!("{:?}", md.timestamp),
-        format!("{:?}", md.val),
-    ];
-
-    m.extend(md.key_values.iter().map(|(k, v)| format!("{k}={v}")));
-
-    m.join(custom_delimiter) + "\n"
+    String::new() /* ~ changed by cargo-mutants ~ */
 }
 
 pub fn serialize_multiple<M: Borrow<MeasurementData>>(measurement_data: &[M]) -> String {
     measurement_data
         .iter()
         .map(|md| serialize_single(md, DELIMITER))
         .join("")
 }

*** result: Success
