*** git_perf/src/serialization.rs:48:23: replace < with == in deserialize_single

*** mutation diff:
--- git_perf/src/serialization.rs
+++ replace < with == in deserialize_single
@@ -40,17 +40,17 @@
 
 fn deserialize_single(line: &str) -> Option<MeasurementData> {
     let components = line
         .split(DELIMITER)
         .filter(|item| !item.is_empty())
         .collect_vec();
 
     let num_components = components.len();
-    if num_components < 4 {
+    if num_components == /* ~ changed by cargo-mutants ~ */ 4 {
         warn!("Too few items with {num_components}, skipping record");
         return None;
     }
 
     let epoch = components[0];
     let epoch = match epoch.parse::<u32>() {
         Ok(e) => e,
         Err(err) => {

*** result: Success
