*** git_perf/src/serialization.rs:91:36: replace == with != in deserialize_single

*** mutation diff:
--- git_perf/src/serialization.rs
+++ replace == with != in deserialize_single
@@ -83,17 +83,17 @@
 
     if components.len() > 4 {
         for kv in components.iter().skip(4) {
             if let Some((key, value)) = kv.split_once('=') {
                 let entry = key_values.entry(key.to_string());
                 let value = value.to_string();
                 match entry {
                     Occupied(mut e) => {
-                        if e.get() == &value {
+                        if e.get() != /* ~ changed by cargo-mutants ~ */ &value {
                             static DUPLICATE_KEY_SAME_VALUE: std::sync::Once =
                                 std::sync::Once::new();
                             DUPLICATE_KEY_SAME_VALUE.call_once(|| {
                                 warn!("Duplicate entries for key {key} with same value");
                             });
                         } else {
                             static DUPLICATE_KEY_CONFLICT: std::sync::Once = std::sync::Once::new();
                             DUPLICATE_KEY_CONFLICT.call_once(|| {

*** result: Success
