*** git_perf/src/stats.rs:116:20: replace - with / in Stats::z_score_with_method

*** mutation diff:
--- git_perf/src/stats.rs
+++ replace - with / in Stats::z_score_with_method
@@ -108,17 +108,17 @@
         assert!(other.len >= 1);
 
         let dispersion = match method {
             DispersionMethod::StandardDeviation => other.stddev,
             DispersionMethod::MedianAbsoluteDeviation => other.mad,
         };
 
         // Division by zero is an expected case here: For measurements with no variance
-        (self.mean - other.mean).abs() / dispersion
+        (self.mean / /* ~ changed by cargo-mutants ~ */ other.mean).abs() / dispersion
     }
 }
 
 impl VecAggregation for Vec<f64> {
     fn median(&mut self) -> Option<f64> {
         self.sort_by(f64::total_cmp);
         match self.len() {
             0 => None,

*** result: Success
