*** git_perf/src/stats.rs:126:38: replace / with % in <impl VecAggregation for Vec<f64>>::median

*** mutation diff:
--- git_perf/src/stats.rs
+++ replace / with % in <impl VecAggregation for Vec<f64>>::median
@@ -118,17 +118,17 @@
 }
 
 impl VecAggregation for Vec<f64> {
     fn median(&mut self) -> Option<f64> {
         self.sort_by(f64::total_cmp);
         match self.len() {
             0 => None,
             even if even % 2 == 0 => {
-                let left = self[even / 2 - 1];
+                let left = self[even % /* ~ changed by cargo-mutants ~ */ 2 - 1];
                 let right = self[even / 2];
                 Some((left + right) / 2.0)
             }
             odd => Some(self[odd / 2]),
         }
     }
 }

*** result: Success
